## **Assignment - 3**


1. Write an SQL query to print the FIRST_NAME from Worker table after removing
white spaces from the right side.



```
SELECT RTRIM(First_Name) as 'First Name'
FROM Worker

```

2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker
table and prints its length.



```

SELECT DISTINCT(Department) as 'Department',
LEN(Department) as 'Length'
FROM Worker


```


3. Write an SQL query to fetch nth max salaries from a table.




```

SELECT MAX(Salary) as '5th Highest Salary'
FROM Worker
WHERE Salary NOT IN
(SELECT DISTINCT TOP 4 (Salary)
FROM Worker
ORDER BY Salary DESC)


```